app/controllers/device_controller.rb

  def register

    # check for missing parameters
    if check_params == false
      #      @message = "0"
      render :text => "0", :status => 417 # Expectation Failed. The server cannot meet the requirements of the Expect request-header field.
      return
    end

    user = User.find(:first, :conditions => ["username = :username and password = :password", params])
    if user == nil
      # if user cannot be identified
      #      @message = "Invalid username or password"
      render :text => "Unauthorized - 401", :status => 401
      return
    end

    # check if user already has a device with the same name registered
    device = user.devices.find(:first, :conditions => ["dev_name = :devicename", params])
    if device == nil


      # If devicename = virtula_container, creates a virtual device on the server
      begin
        if params[:dev_type] == "virtual_container"
          @xmppName = ""
          @xmppPassword = ""
                user.devices.create(:dev_name => params[:devicename],
                            :dev_type => params[:dev_type],
                            :last_seen => DateTime.now,
                            :direct_access => false,
                            :xmppname => @xmppName,
                            :xmpppasswd => @xmppPassword)
---
SELECT * FROM `users` WHERE (username = 'asdasda' and password = 'sdfsdf') LIMIT 1
SELECT * FROM `devices` WHERE (username = 'nikkis' and dev_name = 'saf' and dev_type = 'asfd') LIMIT 1
INSERT INTO `devices` (`address`, `created_at`, `dev_name`, `updated_at`, `username`, `last_seen`, `id_digest`, `dev_type`, `direct_access`) VALUES(NULL, '2009-06-04 05:43:57', 'saf', '2009-06-04 05:43:57', 'nikkis', '2009-06-04 05:43:57', '312ad6909907ff2bf1322b996b9c2036', 'asfd', 0)

  def online
    if not identifyDevice
      render :text => "Unauthorized - 401", :status => 401
      return
    end

    errors = false
    code = false
    if params[:status] != nil

      @status = YAML.load(params[:status])
      @status.each do |key, value|

        if key == 'uploading_file'
          errors, code = beginUpload(value.to_s)

        elsif key.to_s == 'device_location'
          params_location = YAML.load(value)
          puts "la"
          puts "lat: " + params_location['latitude'].to_s
          puts "lo"
          puts "lon: " + params_location['longitude'].to_s

          latest_location = @device.device_locations.find_by_id(@device.latest_location_id)
        #  puts "last lat: " + latest_location.latitude.to_s + " last long: " +  latest_location.longitude.to_s
        #  puts " newydev lat: " + params_location['latitude'].to_S + "  new long: " +  params_location['longitude'].to_s
          if latest_location != nil and latest_location.latitude == params_location['latitude'] and latest_location.longitude == params_location['longitude']

              latest_location.update_attribute(:updated_at, DateTime.now)
---
SELECT * FROM `devices` WHERE (id_digest = '312ad6909907ff2bf1322b996b9c2036') LIMIT 1
UPDATE `devices` SET `updated_at` = '2009-06-04 05:50:49', `last_seen` = '2009-06-04 05:50:49' WHERE `id` = 1