app/controllers/user_controller.rb

INSERT INTO `users` (`real_name`, `username`, `password`) VALUES('testi', 'testi', 'testi')
---
  def register
    @title = "Register"
    if (request.put? and params[:user]) or (request.put? and params[:username])

      # web-ui
      if params[:user]
        @user = User.new(params[:user])

        email_add = @user.username + @@domain
        @user.email = email_add

        if @user.save